redmine/files/2014/08/140807113645_Peticion_AceptacionFacturaCentroGestor

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:giro="http://juntadeandalucia.es/GIRO">
   <soapenv:Header/>
   <soapenv:Body>
      <giro:MT_RF_AceptacionCentroGestor_Request>
         <CABECERA>
            <!--Optional:-->
            <IDINT/>
            <SISTEMA_ORIGEN>ERISG3</SISTEMA_ORIGEN>
            <USUARIO>ZPI_ERISG3</USUARIO>
         </CABECERA>
         <!--Optional:-->
         <lista>
            <!--Zero or more repetitions:-->
            <item>
               <!--Optional:-->
               <IDINT/>
               <SOCIEDAD>1000</SOCIEDAD>
               <EJERCICIO>2013</EJERCICIO>
               <ACREEDOR>
                  <!--Optional:-->
                  <INTERLOCUTOR_COMERCIAL/>
                  <!--Optional:-->
                  <NIF_CIF>A04010344</NIF_CIF>
                  <!--Optional:-->
                  <NOMBRE/>
                  <!--Optional:-->
                  <IDENTIFICADOR/>
                  <!--Optional:-->
                  <CLASE_IDENTIFICADOR/>
               </ACREEDOR>
               <NUMERO_FACTURA>AA162</NUMERO_FACTURA>
               <TIPO_FACTURA>NORM</TIPO_FACTURA>
               <FECHA_DOCUMENTO>2013-11-18T00:00:00.0Z</FECHA_DOCUMENTO>
               <!--Optional:-->
               <FECHA_VENCIMIENTO>2013-11-18T00:00:00.0Z</FECHA_VENCIMIENTO>
               <TEXTO_CABECERA>texto cabecera ws</TEXTO_CABECERA>
               <!--Optional:-->
               <IBAN_ACREEDOR>2222222222</IBAN_ACREEDOR>
               <!--Optional:-->
               <FECHA_ENTRADA_REGISTRO>2013-11-18T00:00:00.0Z</FECHA_ENTRADA_REGISTRO>
               <IMPORTE>50.25</IMPORTE>
               <!--Optional:-->
               <IMPORTE_IMPUESTO>1</IMPORTE_IMPUESTO>
               <!--Optional:-->
               <INDICADOR_IVA>S0</INDICADOR_IVA>
               <!--Optional:-->
               <CALCULO_IMPUESTO_AUTOMATICO>X</CALCULO_IMPUESTO_AUTOMATICO>
               <!--Optional:-->
               <TRACTOS_SUCESIVOS>X</TRACTOS_SUCESIVOS>
               <!--Optional:-->
               <NUM_PROCEDIMIENTO_JUDICIAL/>
               <!--Optional:-->
               <COMPENSACION_ANTICIPOS>X</COMPENSACION_ANTICIPOS>
               <!--Optional:-->
               <NUM_ANTICIPO>123456</NUM_ANTICIPO>
               <!--Optional:-->
               <COD_AGREGACION>AGREGA</COD_AGREGACION>
               <CENTRO_GESTOR>0100010000</CENTRO_GESTOR>
               <POSICION_PRESUPUESTARIA>G/61A/21000/00</POSICION_PRESUPUESTARIA>
               <FONDO>01</FONDO>
               <!--Optional:-->
               <PROYECTO_PRESUPUESTARIO/>
               <!--Optional:-->
               <CENTRO_COSTE>1000</CENTRO_COSTE>
               <PROCEDIMIENTO>ACF</PROCEDIMIENTO>
               <!--Optional:-->
               <LIBRAMIENTO>2</LIBRAMIENTO>
               <CIRCUITO>CONT O</CIRCUITO>
               <TIPO_INTERVENCION>046</TIPO_INTERVENCION>
               <!--Optional:-->
               <EXPEDIENTE_REFERENCIA>EXPEDIENTE REFERENCIA</EXPEDIENTE_REFERENCIA>
               <FASE_INTERVENCION>001</FASE_INTERVENCION>
               <USUARIO>usuario</USUARIO>
               <AREA_GEOGRAFICA>01</AREA_GEOGRAFICA>
               <!--Optional:-->
               <FICHA_CONTRATO>X</FICHA_CONTRATO>
               <!--Optional:-->
               <ACTIVO_FIJO>Act1</ACTIVO_FIJO>
               <!--Optional:-->
               <SUBNUMERO_ACTIVO>Act2</SUBNUMERO_ACTIVO>
               <!--Optional:-->
               <PROVINCIA_ARRENDATARIO/>
               <!--Optional:-->
               <ENDOSATARIO>
                  <!--Optional:-->
                  <INTERLOCUTOR_COMERCIAL/>
                  <!--Optional:-->
                  <NIF_CIF/>
                  <!--Optional:-->
                  <NOMBRE/>
                  <!--Optional:-->
                  <IDENTIFICADOR/>
                  <!--Optional:-->
                  <CLASE_IDENTIFICADOR/>
               </ENDOSATARIO>
               <!--Optional:-->
               <IBAN_ENDOSATARIO/>
               <FECHA_ENDOSO/>
               <FECHA_TOMA_RAZON_ENDOSO/>
               <FECHA_INICIO_PLAZO_ABONO_PRECIO/>
               <!--Optional:-->
               <IVA_EXTRAJERO>
                  <!--Optional:-->
                  <COD_CORESPONDENCIA/>
                  <!--Optional:-->
                  <ESTADO_MIEMBRO/>
                  <!--Optional:-->
                  <PROVINCIA/>
                  <!--Optional:-->
                  <CONDICIONES_ENTREGA/>
                  <!--Optional:-->
                  <NATURALEZA_TRANSACCION/>
                  <!--Optional:-->
                  <MODO_TRANSPORTE/>
                  <!--Optional:-->
                  <PUERTO_CARGA/>
                  <!--Optional:-->
                  <COD_MERCADO/>
                  <!--Optional:-->
                  <REGIMEN_ESTADISTICO/>
                  <!--Optional:-->
                  <MASA_NETA/>
                  <!--Optional:-->
                  <PROVINCIA_ARRENDATARIO/>
                  <!--Optional:-->
                  <COD_PAIS/>
                  <!--Optional:-->
                  <NUMERO_OPERADOR_COMUNITARIO/>
               </IVA_EXTRAJERO>
               <!--Optional:-->
               <lista_posiciones>
                  <!--Zero or more repetitions:-->
                  <item>
                     <!--Optional:-->
                     <IMPORTE/>
                     <!--Optional:-->
                     <IMPORTE_IMPUESTO/>
                     <!--Optional:-->
                     <INDICADOR_IVA/>
                     <!--Optional:-->
                     <CALCULO_IMPUESTO_AUTOMATICO/>
                     <!--Optional:-->
                     <CENTRO_GESTOR/>
                     <!--Optional:-->
                     <POSICION_PRESUPUESTARIA/>
                     <!--Optional:-->
                     <FONDO/>
                     <!--Optional:-->
                     <PROYECTO_PRESUPUESTARIO/>
                     <!--Optional:-->
                     <CENTRO_COSTE/>
                     <!--Optional:-->
                     <ENDOSATARIO>
                        <!--Optional:-->
                        <INTERLOCUTOR_COMERCIAL/>
                        <!--Optional:-->
                        <NIF_CIF/>
                        <!--Optional:-->
                        <NOMBRE/>
                        <!--Optional:-->
                        <IDENTIFICADOR/>
                        <!--Optional:-->
                        <CLASE_IDENTIFICADOR/>
                     </ENDOSATARIO>
                     <lista_retenciones>
                        <item>
                           <INDICADOR_RETENCION/>
                           <BASE_IMPONIBLE/>
                           <IMPORTE/>
                        </item>
                     </lista_retenciones>
                  </item>
               </lista_posiciones>
               <lista_retenciones>
                  <item>
                     <INDICADOR_RETENCION/>
                     <BASE_IMPONIBLE/>
                     <IMPORTE/>
                  </item>
               </lista_retenciones>
            </item>
         </lista>
      </giro:MT_RF_AceptacionCentroGestor_Request>
   </soapenv:Body>
</soapenv:Envelope>